package supermarket;

public class Message {

    public static String welcome = "Доброго дня. Раді Вас бачити в нашому супермаркеті.";
    public static String departs = "У нас є три відділи: продукти харчування (для входу нажміть f), " +
            "напої (для входу нажміть n) та електроніка (для входу нажміть r). Для виходу з супермаркету нажміть q";
    public static String bay = "Раді були Вас бачити в нашому супермаркеті. До побачення";
    public static String incorrect_welcome = "Некоректне введення символу. Ви можете ввести тільки f, n, r або q. " +
            "Для виходу нажміть q";
    public static String food_assortment = "У відділі продуктів харчування у нас є хліб (введіть b), майонез (введіть m), " +
            " крекер(введіть w), ковбаса (введіть u). Зробіть свій вибір. Для виходу нажміть q.";
    public static String beverage_assortment = "У відділі напоїв у нас є вода (введіть z), сік (введіть y)," +
            " пиво (введіть s), вино (введіть v). Зробіть свій вибір. Для виходу нажміть q.";
    public static String electrics_assortment = "У відділі електроніки у нас є мобільні телефони (введіть d), телевізори (введіть g)," +
            " холодильники (введіть j), ноутбуки (введіть l). Зробіть свій вибір. Для виходу нажміть q.";
    public static String bread_message = " грн. - вартість хліба. Введіть скільки хліба Ви хочете купити.";
    public static String majonez_message = " грн. - вартість майонезу. Введіть скільки майонезу Ви хочете купити.";
    public static String kreker_message = " грн. - вартість крекеру. Введіть скільки крекеру Ви хочете купити.";
    public static String sausage_message = " грн. - вартість кг ковбаси. Введіть скільки кг ковбаси Ви хочете купити.";
    public static String error = "невірно введена кількість";
    public static String other_product = "Якщо Ви бажаєте купити інший продукт в цьому відділі нажміть s, " +
            "якщо Ви бажаєте купити продукт в іншому відділі нажміть d, якщо Ви бажаєте закінчити покупки нажміть q";

    public static String order = "Дякуємо, що відвідали наш супермаркет. Вам потрібно заплатити - ";
    public static String good_day = " Гарного дня!";

}

